rain-day27/S32K3_EB_Config/MCAL/BaseNXP_TS_T40D34M50I0R0/header/S32M27x_AEC_AE.h
#define AEC_AE_NOTIFS_MONITOR_FAULTS_ENA_PAR_ERR_MASK (0x80U)
#define AEC_AE_NOTIFS_MONITOR_FAULTS_ENA_PAR_ERR_SHIFT (7U)
#define AEC_AE_NOTIFS_MONITOR_FAULTS_ENA_PAR_ERR_WIDTH (1U)
#define AEC_AE_NOTIFS_MONITOR_FAULTS_ENA_PAR_ERR(x) (((uint32_t)(((uint32_t)(x)) << AEC_AE_NOTIFS_MONITOR_FAULTS_ENA_PAR_ERR_SHIFT)) & AEC_AE_NOTIFS_MONITOR_FAULTS_ENA_PAR_ERR_MASK)

#define AEC_AE_NOTIFS_MONITOR_RSTG_CFG_PAR_VAL_MASK (0x100U)
#define AEC_AE_NOTIFS_MONITOR_RSTG_CFG_PAR_VAL_SHIFT (8U)
#define AEC_AE_NOTIFS_MONITOR_RSTG_CFG_PAR_VAL_WIDTH (1U)
#define AEC_AE_NOTIFS_MONITOR_RSTG_CFG_PAR_VAL(x) (((uint32_t)(((uint32_t)(x)) << AEC_AE_NOTIFS_MONITOR_RSTG_CFG_PAR_VAL_SHIFT)) & AEC_AE_NOTIFS_MONITOR_RSTG_CFG_PAR_VAL_MASK)

#define AEC_AE_NOTIFS_MONITOR_RSTG_CFG_PAR_ERR_MASK (0x200U)
#define AEC_AE_NOTIFS_MONITOR_RSTG_CFG_PAR_ERR_SHIFT (9U)
#define AEC_AE_NOTIFS_MONITOR_RSTG_CFG_PAR_ERR_WIDTH (1U)
#define AEC_AE_NOTIFS_MONITOR_RSTG_CFG_PAR_ERR(x) (((uint32_t)(((uint32_t)(x)) << AEC_AE_NOTIFS_MONITOR_RSTG_CFG_PAR_ERR_SHIFT)) & AEC_AE_NOTIFS_MONITOR_RSTG_CFG_PAR_ERR_MASK)

#define AEC_AE_NOTIFS_MONITOR_OTP_MIRROR_PAR_VAL_MASK (0x400U)
#define AEC_AE_NOTIFS_MONITOR_OTP_MIRROR_PAR_VAL_SHIFT (10U)
#define AEC_AE_NOTIFS_MONITOR_OTP_MIRROR_PAR_VAL_WIDTH (1U)
#define AEC_AE_NOTIFS_MONITOR_OTP_MIRROR_PAR_VAL(x) (((uint32_t)(((uint32_t)(x)) << AEC_AE_NOTIFS_MONITOR_OTP_MIRROR_PAR_VAL_SHIFT)) & AEC_AE_NOTIFS_MONITOR_OTP_MIRROR_PAR_VAL_MASK)

#define AEC_AE_NOTIFS_MONITOR_OTP_MIRROR_PAR_ERR_MASK (0x800U)
#define AEC_AE_NOTIFS_MONITOR_OTP_MIRROR_PAR_ERR_SHIFT (11U)
#define AEC_AE_NOTIFS_MONITOR_OTP_MIRROR_PAR_ERR_WIDTH (1U)
#define AEC_AE_NOTIFS_MONITOR_OTP_MIRROR_PAR_ERR(x) (((uint32_t)(((uint32_t)(x)) << AEC_AE_NOTIFS_MONITOR_OTP_MIRROR_PAR_ERR_SHIFT)) & AEC_AE_NOTIFS_MONITOR_OTP_MIRROR_PAR_ERR_MASK)

#define AEC_AE_NOTIFS_MONITOR_DPGA_PAR_ERR_MASK  (0x10000U)
#define AEC_AE_NOTIFS_MONITOR_DPGA_PAR_ERR_SHIFT (16U)
#define AEC_AE_NOTIFS_MONITOR_DPGA_PAR_ERR_WIDTH (1U)
#define AEC_AE_NOTIFS_MONITOR_DPGA_PAR_ERR(x)    (((uint32_t)(((uint32_t)(x)) << AEC_AE_NOTIFS_MONITOR_DPGA_PAR_ERR_SHIFT)) & AEC_AE_NOTIFS_MONITOR_DPGA_PAR_ERR_MASK)
/*! @} */

/*! @name IRQ_SET - Set Status Bits */
/*! @{ */

#define AEC_AE_IRQ_SET_EVT02_SET_MASK            (0x4U)
#define AEC_AE_IRQ_SET_EVT02_SET_SHIFT           (2U)
#define AEC_AE_IRQ_SET_EVT02_SET_WIDTH           (1U)
#define AEC_AE_IRQ_SET_EVT02_SET(x)              (((uint32_t)(((uint32_t)(x)) << AEC_AE_IRQ_SET_EVT02_SET_SHIFT)) & AEC_AE_IRQ_SET_EVT02_SET_MASK)

#define AEC_AE_IRQ_SET_EVT03_SET_MASK            (0x8U)
#define AEC_AE_IRQ_SET_EVT03_SET_SHIFT           (3U)
#define AEC_AE_IRQ_SET_EVT03_SET_WIDTH           (1U)
#define AEC_AE_IRQ_SET_EVT03_SET(x)              (((uint32_t)(((uint32_t)(x)) << AEC_AE_IRQ_SET_EVT03_SET_SHIFT)) & AEC_AE_IRQ_SET_EVT03_SET_MASK)

#define AEC_AE_IRQ_SET_EVT04_SET_MASK            (0x10U)
#define AEC_AE_IRQ_SET_EVT04_SET_SHIFT           (4U)
#define AEC_AE_IRQ_SET_EVT04_SET_WIDTH           (1U)
#define AEC_AE_IRQ_SET_EVT04_SET(x)              (((uint32_t)(((uint32_t)(x)) << AEC_AE_IRQ_SET_EVT04_SET_SHIFT)) & AEC_AE_IRQ_SET_EVT04_SET_MASK)

#define AEC_AE_IRQ_SET_EVT05_SET_MASK            (0x20U)
#define AEC_AE_IRQ_SET_EVT05_SET_SHIFT           (5U)
#define AEC_AE_IRQ_SET_EVT05_SET_WIDTH           (1U)
#define AEC_AE_IRQ_SET_EVT05_SET(x)              (((uint32_t)(((uint32_t)(x)) << AEC_AE_IRQ_SET_EVT05_SET_SHIFT)) & AEC_AE_IRQ_SET_EVT05_SET_MASK)

#define AEC_AE_IRQ_SET_EVT06_SET_MASK            (0x40U)
#define AEC_AE_IRQ_SET_EVT06_SET_SHIFT           (6U)
#define AEC_AE_IRQ_SET_EVT06_SET_WIDTH           (1U)
#define AEC_AE_IRQ_SET_EVT06_SET(x)              (((uint32_t)(((uint32_t)(x)) << AEC_AE_IRQ_SET_EVT06_SET_SHIFT)) & AEC_AE_IRQ_SET_EVT06_SET_MASK)

#define AEC_AE_IRQ_SET_EVT07_SET_MASK            (0x80U)
#define AEC_AE_IRQ_SET_EVT07_SET_SHIFT           (7U)
#define AEC_AE_IRQ_SET_EVT07_SET_WIDTH           (1U)
#define AEC_AE_IRQ_SET_EVT07_SET(x)              (((uint32_t)(((uint32_t)(x)) << AEC_AE_IRQ_SET_EVT07_SET_SHIFT)) & AEC_AE_IRQ_SET_EVT07_SET_MASK)

#define AEC_AE_IRQ_SET_EVT08_SET_MASK            (0x100U)
#define AEC_AE_IRQ_SET_EVT08_SET_SHIFT           (8U)
#define AEC_AE_IRQ_SET_EVT08_SET_WIDTH           (1U)
#define AEC_AE_IRQ_SET_EVT08_SET(x)              (((uint32_t)(((uint32_t)(x)) << AEC_AE_IRQ_SET_EVT08_SET_SHIFT)) & AEC_AE_IRQ_SET_EVT08_SET_MASK)

#define AEC_AE_IRQ_SET_EVT09_SET_MASK            (0x200U)
#define AEC_AE_IRQ_SET_EVT09_SET_SHIFT           (9U)
#define AEC_AE_IRQ_SET_EVT09_SET_WIDTH           (1U)
#define AEC_AE_IRQ_SET_EVT09_SET(x)              (((uint32_t)(((uint32_t)(x)) << AEC_AE_IRQ_SET_EVT09_SET_SHIFT)) & AEC_AE_IRQ_SET_EVT09_SET_MASK)

#define AEC_AE_IRQ_SET_EVT12_SET_MASK            (0x1000U)
#define AEC_AE_IRQ_SET_EVT12_SET_SHIFT           (12U)
#define AEC_AE_IRQ_SET_EVT12_SET_WIDTH           (1U)
#define AEC_AE_IRQ_SET_EVT12_SET(x)              (((uint32_t)(((uint32_t)(x)) << AEC_AE_IRQ_SET_EVT12_SET_SHIFT)) & AEC_AE_IRQ_SET_EVT12_SET_MASK)

#define AEC_AE_IRQ_SET_EVT14_SET_MASK            (0x4000U)
#define AEC_AE_IRQ_SET_EVT14_SET_SHIFT           (14U)
#define AEC_AE_IRQ_SET_EVT14_SET_WIDTH           (1U)
#define AEC_AE_IRQ_SET_EVT14_SET(x)              (((uint32_t)(((uint32_t)(x)) << AEC_AE_IRQ_SET_EVT14_SET_SHIFT)) & AEC_AE_IRQ_SET_EVT14_SET_MASK)

#define AEC_AE_IRQ_SET_EVT15_SET_MASK            (0x8000U)
#define AEC_AE_IRQ_SET_EVT15_SET_SHIFT           (15U)
#define AEC_AE_IRQ_SET_EVT15_SET_WIDTH           (1U)
#define AEC_AE_IRQ_SET_EVT15_SET(x)              (((uint32_t)(((uint32_t)(x)) << AEC_AE_IRQ_SET_EVT15_SET_SHIFT)) & AEC_AE_IRQ_SET_EVT15_SET_MASK)

#define AEC_AE_IRQ_SET_FLT00_SET_MASK            (0x10000U)
#define AEC_AE_IRQ_SET_FLT00_SET_SHIFT           (16U)
#define AEC_AE_IRQ_SET_FLT00_SET_WIDTH           (1U)
#define AEC_AE_IRQ_SET_FLT00_SET(x)              (((uint32_t)(((uint32_t)(x)) << AEC_AE_IRQ_SET_FLT00_SET_SHIFT)) & AEC_AE_IRQ_SET_FLT00_SET_MASK)

#define AEC_AE_IRQ_SET_FLT01_SET_MASK            (0x20000U)
#define AEC_AE_IRQ_SET_FLT01_SET_SHIFT           (17U)
#define AEC_AE_IRQ_SET_FLT01_SET_WIDTH           (1U)
#define AEC_AE_IRQ_SET_FLT01_SET(x)              (((uint32_t)(((uint32_t)(x)) << AEC_AE_IRQ_SET_FLT01_SET_SHIFT)) & AEC_AE_IRQ_SET_FLT01_SET_MASK)

#define AEC_AE_IRQ_SET_FLT02_SET_MASK            (0x40000U)
#define AEC_AE_IRQ_SET_FLT02_SET_SHIFT           (18U)
#define AEC_AE_IRQ_SET_FLT02_SET_WIDTH           (1U)
#define AEC_AE_IRQ_SET_FLT02_SET(x)              (((uint32_t)(((uint32_t)(x)) << AEC_AE_IRQ_SET_FLT02_SET_SHIFT)) & AEC_AE_IRQ_SET_FLT02_SET_MASK)

