rain-day27/S32K3_EB_Config/MCAL/BaseNXP_TS_T40D34M50I0R0/header/S32M27x_AEC_AE.h
#define AEC_AE_IO_FUNCMUX_CFG_VDDE_SEL_MASK      (0x200U)
#define AEC_AE_IO_FUNCMUX_CFG_VDDE_SEL_SHIFT     (9U)
#define AEC_AE_IO_FUNCMUX_CFG_VDDE_SEL_WIDTH     (1U)
#define AEC_AE_IO_FUNCMUX_CFG_VDDE_SEL(x)        (((uint32_t)(((uint32_t)(x)) << AEC_AE_IO_FUNCMUX_CFG_VDDE_SEL_SHIFT)) & AEC_AE_IO_FUNCMUX_CFG_VDDE_SEL_MASK)

#define AEC_AE_IO_FUNCMUX_CFG_PHY_SEL_MASK       (0xC00U)
#define AEC_AE_IO_FUNCMUX_CFG_PHY_SEL_SHIFT      (10U)
#define AEC_AE_IO_FUNCMUX_CFG_PHY_SEL_WIDTH      (2U)
#define AEC_AE_IO_FUNCMUX_CFG_PHY_SEL(x)         (((uint32_t)(((uint32_t)(x)) << AEC_AE_IO_FUNCMUX_CFG_PHY_SEL_SHIFT)) & AEC_AE_IO_FUNCMUX_CFG_PHY_SEL_MASK)

#define AEC_AE_IO_FUNCMUX_CFG_VDDE_OCD_EN_MASK   (0x1000U)
#define AEC_AE_IO_FUNCMUX_CFG_VDDE_OCD_EN_SHIFT  (12U)
#define AEC_AE_IO_FUNCMUX_CFG_VDDE_OCD_EN_WIDTH  (1U)
#define AEC_AE_IO_FUNCMUX_CFG_VDDE_OCD_EN(x)     (((uint32_t)(((uint32_t)(x)) << AEC_AE_IO_FUNCMUX_CFG_VDDE_OCD_EN_SHIFT)) & AEC_AE_IO_FUNCMUX_CFG_VDDE_OCD_EN_MASK)

#define AEC_AE_IO_FUNCMUX_CFG_D2D_EN_MASK        (0x10000U)
#define AEC_AE_IO_FUNCMUX_CFG_D2D_EN_SHIFT       (16U)
#define AEC_AE_IO_FUNCMUX_CFG_D2D_EN_WIDTH       (1U)
#define AEC_AE_IO_FUNCMUX_CFG_D2D_EN(x)          (((uint32_t)(((uint32_t)(x)) << AEC_AE_IO_FUNCMUX_CFG_D2D_EN_SHIFT)) & AEC_AE_IO_FUNCMUX_CFG_D2D_EN_MASK)

#define AEC_AE_IO_FUNCMUX_CFG_OUTSEL_MASK        (0x20000U)
#define AEC_AE_IO_FUNCMUX_CFG_OUTSEL_SHIFT       (17U)
#define AEC_AE_IO_FUNCMUX_CFG_OUTSEL_WIDTH       (1U)
#define AEC_AE_IO_FUNCMUX_CFG_OUTSEL(x)          (((uint32_t)(((uint32_t)(x)) << AEC_AE_IO_FUNCMUX_CFG_OUTSEL_SHIFT)) & AEC_AE_IO_FUNCMUX_CFG_OUTSEL_MASK)

#define AEC_AE_IO_FUNCMUX_CFG_CLKSEL_MASK        (0xC0000U)
#define AEC_AE_IO_FUNCMUX_CFG_CLKSEL_SHIFT       (18U)
#define AEC_AE_IO_FUNCMUX_CFG_CLKSEL_WIDTH       (2U)
#define AEC_AE_IO_FUNCMUX_CFG_CLKSEL(x)          (((uint32_t)(((uint32_t)(x)) << AEC_AE_IO_FUNCMUX_CFG_CLKSEL_SHIFT)) & AEC_AE_IO_FUNCMUX_CFG_CLKSEL_MASK)
/*! @} */

/*! @name LINPHY_CFG - LINPHY Configuration */
/*! @{ */

#define AEC_AE_LINPHY_CFG_MODE_MASK              (0x3U)
#define AEC_AE_LINPHY_CFG_MODE_SHIFT             (0U)
#define AEC_AE_LINPHY_CFG_MODE_WIDTH             (2U)
#define AEC_AE_LINPHY_CFG_MODE(x)                (((uint16_t)(((uint16_t)(x)) << AEC_AE_LINPHY_CFG_MODE_SHIFT)) & AEC_AE_LINPHY_CFG_MODE_MASK)

#define AEC_AE_LINPHY_CFG_ENAWUP_MASK            (0x4U)
#define AEC_AE_LINPHY_CFG_ENAWUP_SHIFT           (2U)
#define AEC_AE_LINPHY_CFG_ENAWUP_WIDTH           (1U)
#define AEC_AE_LINPHY_CFG_ENAWUP(x)              (((uint16_t)(((uint16_t)(x)) << AEC_AE_LINPHY_CFG_ENAWUP_SHIFT)) & AEC_AE_LINPHY_CFG_ENAWUP_MASK)

#define AEC_AE_LINPHY_CFG_ENATXTO_MASK           (0x8U)
#define AEC_AE_LINPHY_CFG_ENATXTO_SHIFT          (3U)
#define AEC_AE_LINPHY_CFG_ENATXTO_WIDTH          (1U)
#define AEC_AE_LINPHY_CFG_ENATXTO(x)             (((uint16_t)(((uint16_t)(x)) << AEC_AE_LINPHY_CFG_ENATXTO_SHIFT)) & AEC_AE_LINPHY_CFG_ENATXTO_MASK)

#define AEC_AE_LINPHY_CFG_SLEW_MASK              (0x30U)
#define AEC_AE_LINPHY_CFG_SLEW_SHIFT             (4U)
#define AEC_AE_LINPHY_CFG_SLEW_WIDTH             (2U)
#define AEC_AE_LINPHY_CFG_SLEW(x)                (((uint16_t)(((uint16_t)(x)) << AEC_AE_LINPHY_CFG_SLEW_SHIFT)) & AEC_AE_LINPHY_CFG_SLEW_MASK)

#define AEC_AE_LINPHY_CFG_CXPI_NSLP_MASK         (0x100U)
#define AEC_AE_LINPHY_CFG_CXPI_NSLP_SHIFT        (8U)
#define AEC_AE_LINPHY_CFG_CXPI_NSLP_WIDTH        (1U)
#define AEC_AE_LINPHY_CFG_CXPI_NSLP(x)           (((uint16_t)(((uint16_t)(x)) << AEC_AE_LINPHY_CFG_CXPI_NSLP_SHIFT)) & AEC_AE_LINPHY_CFG_CXPI_NSLP_MASK)

#define AEC_AE_LINPHY_CFG_CXPI_MS_MASK           (0x200U)
#define AEC_AE_LINPHY_CFG_CXPI_MS_SHIFT          (9U)
#define AEC_AE_LINPHY_CFG_CXPI_MS_WIDTH          (1U)
#define AEC_AE_LINPHY_CFG_CXPI_MS(x)             (((uint16_t)(((uint16_t)(x)) << AEC_AE_LINPHY_CFG_CXPI_MS_SHIFT)) & AEC_AE_LINPHY_CFG_CXPI_MS_MASK)

#define AEC_AE_LINPHY_CFG_CXPI_SLOPE_MASK        (0x400U)
#define AEC_AE_LINPHY_CFG_CXPI_SLOPE_SHIFT       (10U)
#define AEC_AE_LINPHY_CFG_CXPI_SLOPE_WIDTH       (1U)
#define AEC_AE_LINPHY_CFG_CXPI_SLOPE(x)          (((uint16_t)(((uint16_t)(x)) << AEC_AE_LINPHY_CFG_CXPI_SLOPE_SHIFT)) & AEC_AE_LINPHY_CFG_CXPI_SLOPE_MASK)

#define AEC_AE_LINPHY_CFG_CXPI_BOOST_MASK        (0x800U)
#define AEC_AE_LINPHY_CFG_CXPI_BOOST_SHIFT       (11U)
#define AEC_AE_LINPHY_CFG_CXPI_BOOST_WIDTH       (1U)
#define AEC_AE_LINPHY_CFG_CXPI_BOOST(x)          (((uint16_t)(((uint16_t)(x)) << AEC_AE_LINPHY_CFG_CXPI_BOOST_SHIFT)) & AEC_AE_LINPHY_CFG_CXPI_BOOST_MASK)

#define AEC_AE_LINPHY_CFG_LIN_CXPI_SEL_MASK      (0x4000U)
#define AEC_AE_LINPHY_CFG_LIN_CXPI_SEL_SHIFT     (14U)
#define AEC_AE_LINPHY_CFG_LIN_CXPI_SEL_WIDTH     (1U)
#define AEC_AE_LINPHY_CFG_LIN_CXPI_SEL(x)        (((uint16_t)(((uint16_t)(x)) << AEC_AE_LINPHY_CFG_LIN_CXPI_SEL_SHIFT)) & AEC_AE_LINPHY_CFG_LIN_CXPI_SEL_MASK)

#define AEC_AE_LINPHY_CFG_LINPHY_ENABLE_MASK     (0x8000U)
#define AEC_AE_LINPHY_CFG_LINPHY_ENABLE_SHIFT    (15U)
#define AEC_AE_LINPHY_CFG_LINPHY_ENABLE_WIDTH    (1U)
#define AEC_AE_LINPHY_CFG_LINPHY_ENABLE(x)       (((uint16_t)(((uint16_t)(x)) << AEC_AE_LINPHY_CFG_LINPHY_ENABLE_SHIFT)) & AEC_AE_LINPHY_CFG_LINPHY_ENABLE_MASK)
/*! @} */

/*! @name LINPHY_MONITOR - LINPHY Monitor */
/*! @{ */

#define AEC_AE_LINPHY_MONITOR_LINPHY_WKUP_FL_MASK (0x1U)
#define AEC_AE_LINPHY_MONITOR_LINPHY_WKUP_FL_SHIFT (0U)
#define AEC_AE_LINPHY_MONITOR_LINPHY_WKUP_FL_WIDTH (1U)
#define AEC_AE_LINPHY_MONITOR_LINPHY_WKUP_FL(x)  (((uint32_t)(((uint32_t)(x)) << AEC_AE_LINPHY_MONITOR_LINPHY_WKUP_FL_SHIFT)) & AEC_AE_LINPHY_MONITOR_LINPHY_WKUP_FL_MASK)

#define AEC_AE_LINPHY_MONITOR_LINPHY_SCPSTATE_FL_MASK (0x2U)
#define AEC_AE_LINPHY_MONITOR_LINPHY_SCPSTATE_FL_SHIFT (1U)
#define AEC_AE_LINPHY_MONITOR_LINPHY_SCPSTATE_FL_WIDTH (1U)
#define AEC_AE_LINPHY_MONITOR_LINPHY_SCPSTATE_FL(x) (((uint32_t)(((uint32_t)(x)) << AEC_AE_LINPHY_MONITOR_LINPHY_SCPSTATE_FL_SHIFT)) & AEC_AE_LINPHY_MONITOR_LINPHY_SCPSTATE_FL_MASK)

#define AEC_AE_LINPHY_MONITOR_LINPHY_TXTOSTATE_FL_MASK (0x4U)
#define AEC_AE_LINPHY_MONITOR_LINPHY_TXTOSTATE_FL_SHIFT (2U)
#define AEC_AE_LINPHY_MONITOR_LINPHY_TXTOSTATE_FL_WIDTH (1U)
#define AEC_AE_LINPHY_MONITOR_LINPHY_TXTOSTATE_FL(x) (((uint32_t)(((uint32_t)(x)) << AEC_AE_LINPHY_MONITOR_LINPHY_TXTOSTATE_FL_SHIFT)) & AEC_AE_LINPHY_MONITOR_LINPHY_TXTOSTATE_FL_MASK)

