rain-day27/S32K3_EB_Config/MCAL/BaseNXP_TS_T40D34M50I0R0/header/S32M27x_AEC_AE.h
#define AEC_AE_LINPHY_MONITOR_LINPHY_ERROR_FL_MASK (0x8U)
#define AEC_AE_LINPHY_MONITOR_LINPHY_ERROR_FL_SHIFT (3U)
#define AEC_AE_LINPHY_MONITOR_LINPHY_ERROR_FL_WIDTH (1U)
#define AEC_AE_LINPHY_MONITOR_LINPHY_ERROR_FL(x) (((uint32_t)(((uint32_t)(x)) << AEC_AE_LINPHY_MONITOR_LINPHY_ERROR_FL_SHIFT)) & AEC_AE_LINPHY_MONITOR_LINPHY_ERROR_FL_MASK)

#define AEC_AE_LINPHY_MONITOR_LINPHY_WKUP_MON_MASK (0x10U)
#define AEC_AE_LINPHY_MONITOR_LINPHY_WKUP_MON_SHIFT (4U)
#define AEC_AE_LINPHY_MONITOR_LINPHY_WKUP_MON_WIDTH (1U)
#define AEC_AE_LINPHY_MONITOR_LINPHY_WKUP_MON(x) (((uint32_t)(((uint32_t)(x)) << AEC_AE_LINPHY_MONITOR_LINPHY_WKUP_MON_SHIFT)) & AEC_AE_LINPHY_MONITOR_LINPHY_WKUP_MON_MASK)

#define AEC_AE_LINPHY_MONITOR_LINPHY_SCPSTATE_MON_MASK (0x20U)
#define AEC_AE_LINPHY_MONITOR_LINPHY_SCPSTATE_MON_SHIFT (5U)
#define AEC_AE_LINPHY_MONITOR_LINPHY_SCPSTATE_MON_WIDTH (1U)
#define AEC_AE_LINPHY_MONITOR_LINPHY_SCPSTATE_MON(x) (((uint32_t)(((uint32_t)(x)) << AEC_AE_LINPHY_MONITOR_LINPHY_SCPSTATE_MON_SHIFT)) & AEC_AE_LINPHY_MONITOR_LINPHY_SCPSTATE_MON_MASK)

#define AEC_AE_LINPHY_MONITOR_LINPHY_TXTOSTATE_MON_MASK (0x40U)
#define AEC_AE_LINPHY_MONITOR_LINPHY_TXTOSTATE_MON_SHIFT (6U)
#define AEC_AE_LINPHY_MONITOR_LINPHY_TXTOSTATE_MON_WIDTH (1U)
#define AEC_AE_LINPHY_MONITOR_LINPHY_TXTOSTATE_MON(x) (((uint32_t)(((uint32_t)(x)) << AEC_AE_LINPHY_MONITOR_LINPHY_TXTOSTATE_MON_SHIFT)) & AEC_AE_LINPHY_MONITOR_LINPHY_TXTOSTATE_MON_MASK)

#define AEC_AE_LINPHY_MONITOR_LINPHY_ERROR_MON_MASK (0x80U)
#define AEC_AE_LINPHY_MONITOR_LINPHY_ERROR_MON_SHIFT (7U)
#define AEC_AE_LINPHY_MONITOR_LINPHY_ERROR_MON_WIDTH (1U)
#define AEC_AE_LINPHY_MONITOR_LINPHY_ERROR_MON(x) (((uint32_t)(((uint32_t)(x)) << AEC_AE_LINPHY_MONITOR_LINPHY_ERROR_MON_SHIFT)) & AEC_AE_LINPHY_MONITOR_LINPHY_ERROR_MON_MASK)

#define AEC_AE_LINPHY_MONITOR_LINPHY_WKUP_EN_MASK (0x100U)
#define AEC_AE_LINPHY_MONITOR_LINPHY_WKUP_EN_SHIFT (8U)
#define AEC_AE_LINPHY_MONITOR_LINPHY_WKUP_EN_WIDTH (1U)
#define AEC_AE_LINPHY_MONITOR_LINPHY_WKUP_EN(x)  (((uint32_t)(((uint32_t)(x)) << AEC_AE_LINPHY_MONITOR_LINPHY_WKUP_EN_SHIFT)) & AEC_AE_LINPHY_MONITOR_LINPHY_WKUP_EN_MASK)

#define AEC_AE_LINPHY_MONITOR_LINPHY_SCPSTATE_EN_MASK (0x200U)
#define AEC_AE_LINPHY_MONITOR_LINPHY_SCPSTATE_EN_SHIFT (9U)
#define AEC_AE_LINPHY_MONITOR_LINPHY_SCPSTATE_EN_WIDTH (1U)
#define AEC_AE_LINPHY_MONITOR_LINPHY_SCPSTATE_EN(x) (((uint32_t)(((uint32_t)(x)) << AEC_AE_LINPHY_MONITOR_LINPHY_SCPSTATE_EN_SHIFT)) & AEC_AE_LINPHY_MONITOR_LINPHY_SCPSTATE_EN_MASK)

#define AEC_AE_LINPHY_MONITOR_LINPHY_TXTOSTATE_EN_MASK (0x400U)
#define AEC_AE_LINPHY_MONITOR_LINPHY_TXTOSTATE_EN_SHIFT (10U)
#define AEC_AE_LINPHY_MONITOR_LINPHY_TXTOSTATE_EN_WIDTH (1U)
#define AEC_AE_LINPHY_MONITOR_LINPHY_TXTOSTATE_EN(x) (((uint32_t)(((uint32_t)(x)) << AEC_AE_LINPHY_MONITOR_LINPHY_TXTOSTATE_EN_SHIFT)) & AEC_AE_LINPHY_MONITOR_LINPHY_TXTOSTATE_EN_MASK)

#define AEC_AE_LINPHY_MONITOR_LINPHY_ERROR_EN_MASK (0x800U)
#define AEC_AE_LINPHY_MONITOR_LINPHY_ERROR_EN_SHIFT (11U)
#define AEC_AE_LINPHY_MONITOR_LINPHY_ERROR_EN_WIDTH (1U)
#define AEC_AE_LINPHY_MONITOR_LINPHY_ERROR_EN(x) (((uint32_t)(((uint32_t)(x)) << AEC_AE_LINPHY_MONITOR_LINPHY_ERROR_EN_SHIFT)) & AEC_AE_LINPHY_MONITOR_LINPHY_ERROR_EN_MASK)

#define AEC_AE_LINPHY_MONITOR_CXPI_WKUP_FL_MASK  (0x10000U)
#define AEC_AE_LINPHY_MONITOR_CXPI_WKUP_FL_SHIFT (16U)
#define AEC_AE_LINPHY_MONITOR_CXPI_WKUP_FL_WIDTH (1U)
#define AEC_AE_LINPHY_MONITOR_CXPI_WKUP_FL(x)    (((uint32_t)(((uint32_t)(x)) << AEC_AE_LINPHY_MONITOR_CXPI_WKUP_FL_SHIFT)) & AEC_AE_LINPHY_MONITOR_CXPI_WKUP_FL_MASK)

#define AEC_AE_LINPHY_MONITOR_CXPI_DOMTIMOUT_FL_MASK (0x20000U)
#define AEC_AE_LINPHY_MONITOR_CXPI_DOMTIMOUT_FL_SHIFT (17U)
#define AEC_AE_LINPHY_MONITOR_CXPI_DOMTIMOUT_FL_WIDTH (1U)
#define AEC_AE_LINPHY_MONITOR_CXPI_DOMTIMOUT_FL(x) (((uint32_t)(((uint32_t)(x)) << AEC_AE_LINPHY_MONITOR_CXPI_DOMTIMOUT_FL_SHIFT)) & AEC_AE_LINPHY_MONITOR_CXPI_DOMTIMOUT_FL_MASK)

#define AEC_AE_LINPHY_MONITOR_CXPI_ARBIT_FL_MASK (0x40000U)
#define AEC_AE_LINPHY_MONITOR_CXPI_ARBIT_FL_SHIFT (18U)
#define AEC_AE_LINPHY_MONITOR_CXPI_ARBIT_FL_WIDTH (1U)
#define AEC_AE_LINPHY_MONITOR_CXPI_ARBIT_FL(x)   (((uint32_t)(((uint32_t)(x)) << AEC_AE_LINPHY_MONITOR_CXPI_ARBIT_FL_SHIFT)) & AEC_AE_LINPHY_MONITOR_CXPI_ARBIT_FL_MASK)

#define AEC_AE_LINPHY_MONITOR_CXPI_WKUP_MON_MASK (0x100000U)
#define AEC_AE_LINPHY_MONITOR_CXPI_WKUP_MON_SHIFT (20U)
#define AEC_AE_LINPHY_MONITOR_CXPI_WKUP_MON_WIDTH (1U)
#define AEC_AE_LINPHY_MONITOR_CXPI_WKUP_MON(x)   (((uint32_t)(((uint32_t)(x)) << AEC_AE_LINPHY_MONITOR_CXPI_WKUP_MON_SHIFT)) & AEC_AE_LINPHY_MONITOR_CXPI_WKUP_MON_MASK)

#define AEC_AE_LINPHY_MONITOR_CXPI_DOMTIMOUT_MON_MASK (0x200000U)
#define AEC_AE_LINPHY_MONITOR_CXPI_DOMTIMOUT_MON_SHIFT (21U)
#define AEC_AE_LINPHY_MONITOR_CXPI_DOMTIMOUT_MON_WIDTH (1U)
#define AEC_AE_LINPHY_MONITOR_CXPI_DOMTIMOUT_MON(x) (((uint32_t)(((uint32_t)(x)) << AEC_AE_LINPHY_MONITOR_CXPI_DOMTIMOUT_MON_SHIFT)) & AEC_AE_LINPHY_MONITOR_CXPI_DOMTIMOUT_MON_MASK)

#define AEC_AE_LINPHY_MONITOR_CXPI_ARBIT_MON_MASK (0x400000U)
#define AEC_AE_LINPHY_MONITOR_CXPI_ARBIT_MON_SHIFT (22U)
#define AEC_AE_LINPHY_MONITOR_CXPI_ARBIT_MON_WIDTH (1U)
#define AEC_AE_LINPHY_MONITOR_CXPI_ARBIT_MON(x)  (((uint32_t)(((uint32_t)(x)) << AEC_AE_LINPHY_MONITOR_CXPI_ARBIT_MON_SHIFT)) & AEC_AE_LINPHY_MONITOR_CXPI_ARBIT_MON_MASK)

#define AEC_AE_LINPHY_MONITOR_CXPI_WKUP_EN_MASK  (0x1000000U)
#define AEC_AE_LINPHY_MONITOR_CXPI_WKUP_EN_SHIFT (24U)
#define AEC_AE_LINPHY_MONITOR_CXPI_WKUP_EN_WIDTH (1U)
#define AEC_AE_LINPHY_MONITOR_CXPI_WKUP_EN(x)    (((uint32_t)(((uint32_t)(x)) << AEC_AE_LINPHY_MONITOR_CXPI_WKUP_EN_SHIFT)) & AEC_AE_LINPHY_MONITOR_CXPI_WKUP_EN_MASK)

#define AEC_AE_LINPHY_MONITOR_CXPI_DOMTIMOUT_EN_MASK (0x2000000U)
#define AEC_AE_LINPHY_MONITOR_CXPI_DOMTIMOUT_EN_SHIFT (25U)
#define AEC_AE_LINPHY_MONITOR_CXPI_DOMTIMOUT_EN_WIDTH (1U)
#define AEC_AE_LINPHY_MONITOR_CXPI_DOMTIMOUT_EN(x) (((uint32_t)(((uint32_t)(x)) << AEC_AE_LINPHY_MONITOR_CXPI_DOMTIMOUT_EN_SHIFT)) & AEC_AE_LINPHY_MONITOR_CXPI_DOMTIMOUT_EN_MASK)

#define AEC_AE_LINPHY_MONITOR_CXPI_ARBIT_EN_MASK (0x4000000U)
#define AEC_AE_LINPHY_MONITOR_CXPI_ARBIT_EN_SHIFT (26U)
#define AEC_AE_LINPHY_MONITOR_CXPI_ARBIT_EN_WIDTH (1U)
#define AEC_AE_LINPHY_MONITOR_CXPI_ARBIT_EN(x)   (((uint32_t)(((uint32_t)(x)) << AEC_AE_LINPHY_MONITOR_CXPI_ARBIT_EN_SHIFT)) & AEC_AE_LINPHY_MONITOR_CXPI_ARBIT_EN_MASK)
/*! @} */

/*! @name CANPHY_CFG - CANPHY Configuration */
/*! @{ */

